jnaulet/OpenPicoRTOS/staging/demo/ch32v003f4p6-r0-1v1/main.c
#include "picoRTOS.h"
#include "picoRTOS_device.h"
#include "ch32v003f4p6-r0-1v1.h"

#include <stdint.h>

static void tick_main(void *priv)
{
    picoRTOS_assert(priv != NULL, picoRTOS_kill(EINVAL));

    struct gpio *TICK = (struct gpio*)priv;

    for (;;) {
        gpio_toggle(TICK);
        picoRTOS_schedule();
    }
}

static void led_main(void *priv)
{
    picoRTOS_assert(priv != NULL, picoRTOS_kill(EINVAL));

    struct gpio *LED = (struct gpio*)priv;
    picoRTOS_tick_t ref = picoRTOS_get_tick();

    for (;;) {
        gpio_write(LED, false);
        picoRTOS_sleep(PICORTOS_DELAY_MSEC(60));
        gpio_write(LED, true);
        picoRTOS_sleep(PICORTOS_DELAY_MSEC(60));
        gpio_write(LED, false);
        picoRTOS_sleep(PICORTOS_DELAY_MSEC(120));
        gpio_write(LED, true);

        /* until next second */
        picoRTOS_sleep_until(&ref, PICORTOS_DELAY_SEC(1));
    }
}

int main(void)
{
    struct picoRTOS_task task;
    static picoRTOS_stack_t stack0[CONFIG_DEFAULT_STACK_COUNT];
    static picoRTOS_stack_t stack1[CONFIG_DEFAULT_STACK_COUNT];

    static struct ch32v003f4p6 ch32;

    (void)ch32v003f4p6_init(&ch32);
    picoRTOS_init();

    /* tick */
    picoRTOS_task_init(&task, tick_main, &ch32.TICK, stack0, PICORTOS_STACK_COUNT(stack0));
    picoRTOS_add_task(&task, picoRTOS_get_next_available_priority());
    /* led */
    picoRTOS_task_init(&task, led_main, &ch32.LED1, stack1, PICORTOS_STACK_COUNT(stack1));
    picoRTOS_add_task(&task, picoRTOS_get_next_available_priority());

    picoRTOS_start();

    /* not supposed to end there */
    picoRTOS_assert_void(false);
    return 1;
}
